#
# TA-kaspersky
# props.conf
#
# Configuration using the LEEF option
#

[kaspersky]
pulldown_type = true
category = Network & Security
description = Kaspersky ES events
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

TRANSFORMS-rename = kaspersky_threat, kaspersky_devctrl, kaspersky_system, kaspersky_appctrl

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
#FIELDALIAS-signature = EVC_EV_VIRUS_NAME AS signature
EXTRACT-signature = (?:(?:Result\\Name\:\s+)|(?:Untreated\:\s+))(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
# tag - todo in tags.conf
#FIELDALIAS-user = usrName AS user
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version - todo in lookup files?


### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =

##################################
# TO BE MOVED TO OTHER SOURCETYPES
EXTRACT-fields = \|(?<vendor>[^\|]*)\|(?<product>[^\|]*)\|(?<version>[^\|]*)\|(?<raw_operation>[^\|]*)\|
#EXTRACT-operation = Event type\:\s+(?<operation>[^\\]*)
#EXTRACT-devcategory = Device category\:\s+(?<dev_category>[^\\]*)
#EXTRACT-devtype = Bus type\:\s+(?<dev_type>[^\\]*)
#EXTRACT-devid = Device ID\:\s+(?<dev_id>[^\\]*)
#EXTRACT-action = Verdict\:\s+(?<action>[^\\]*)
#EXTRACT-application = Application\\Name\:\s+(?<application>[^\\]*)
#FIELDALIAS-srcname = EVC_EV_DISP_HOST_NAME AS src_name
#FIELDALIAS-srcip = src AS src_ip
#FIELDALIAS-productname = EVC_EV_KL_PRODUCT_NAME AS product_name
#FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
#FIELDALIAS-devid = EVC_EV_EXT_DEV_ID AS dev_id

#### OLD VERSION [kaspersky_threat] ####
#[kaspersky_threat]
#
#LEEF:1.0|KasperskyLab|SecurityCenter|10.2.434|GNRL_EV_ATTACK_DETECTED
#EXTRACT-eventtype = Event\s+type\:\s+(?<event_type>[^\\]*)
#EXTRACT-application = Application\\Name\:\s+(?<application>[^\\]*)
#User:	, ,  (Active user)\r\n
#EXTRACT-user =
#EXTRACT-component = Component\:\s+(?<component>[^\\]*)
#EXTRACT-action = Result\\Description\:\s+(?<action>[^\\]*)
#EXTRACT-signature = Result\\Name\:\s+(?<signature>[^\\\s]*)
#Object:	TCP from 10.18.53.5 to
#FIELDALIAS-srcname = EVC_EV_DISP_HOST_NAME AS src_name
#FIELDALIAS-srcip = src AS src_ip
#identSrc=10.18.53.11
#identNetBios=SW185601
#EVC_EV_KL_PRODUCT_DISPVER=10.2.2.10535
#FIELDALIAS-productname = EVC_EV_KL_PRODUCT_NAME AS product_name
#FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
#FIELDALIAS-category = cat AS category

#### OLD VERSION [kaspersky_devctrl] ####
#[kaspersky_devctrl]
#
#EXTRACT-fields = \|(?<vendor>[^\|]*)\|(?<product>[^\|]*)\|(?<version>[^\|]*)\|(?<raw_operation>[^\|]*)\|
#EXTRACT-operation = Event type\:\s+(?<operation>[^\\]*)
#EXTRACT-devcategory = Device category\:\s+(?<dev_category>[^\\]*)
#EXTRACT-devtype = Bus type\:\s+(?<dev_type>[^\\]*)
#EXTRACT-devid = Device ID\:\s+(?<dev_id>[^\\]*)
#EXTRACT-action = Verdict\:\s+(?<action>[^\\]*)
#
#FIELDALIAS-category = cat AS category
#FIELDALIAS-dvcip = identSrc AS dvc_ip
#FIELDALIAS-srcname = EVC_EV_DISP_HOST_NAME AS src_name
#FIELDALIAS-srcip = src AS src_ip
#FIELDALIAS-productname = EVC_EV_KL_PRODUCT_NAME AS product_name
#FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
#FIELDALIAS-devid = EVC_EV_EXT_DEV_ID AS dev_id

[kaspersky_leef_defaults]
#### BASE FIELDS FOR LEEF FORMAT
#Cat - string - Event category
#devTime - date - Time the device or application emitted the event
#FIELDALIAS-category = Cat AS category
#devTimeFormat - string - Defined by the java SimpleDateFormat.
#proto - integer - Transport protocol
#FIELDALIAS-protocol = proto AS protocol
#sev - integer (1-10) - Severity of this event
#FIELDALIAS-severity = sev AS severity
#src - IPv4 or IPv6 address - Source address
#FIELDALIAS-srcip = src AS src_ip
#dst - IPv4 or IPv6 address - Destination address
#FIELDALIAS-destip = dst AS dest_ip
#VSrc - IPv4 or IPv6 address - Virtual source address
#FIELDALIAS-srcip = VSrc AS src_ip
#srcPort - integer - Source Port. The valid port numbers are between 0 and 65535.
#FIELDALIAS-srcport = srcPort AS src_port
#dstPort - integer - Destination Port. The valid port numbers are between 0 and 65535.
#FIELDALIAS-destport = dstPort AS dest_port
#srcPreNat - IPv4 or IPv6 address - Source address for the message before Network Address Translation (NAT) occurred
#dstPreNat - IPv4 or IPv6 address
#Destination address for the message before Network Address Translation (NAT) occurred
#srcPostNat - IPv4 or IPv6 address
#Source address for the message after Network Address Translation (NAT) occurred
#dstPostNat - IPv4 or IPv6 address - Destination address for the message after Network Address Translation (NAT) occurred
#usrName - string 255 - User name associated with the event
#FIELDALIAS-user = usrName AS user
#srcMAC - MAC address
#Six colon-separated hexadecimal numbers. Example:“1:2D:67:BF:1A:71”
#FIELDALIAS-srcmac = srcMAC AS src_mac
#dstMAC - MAC address
#Six colon-separated hexadecimal numbers. Example:“11:2D:67:BF:1A:71”
#FIELDALIAS-destmac = dstMAC AS dest_mac
#srcPreNATPort - integer
#Source Port. The valid port numbers are between 0 and 65535.
#dstPreNATPort - integer
#Destination Port. The valid port numbers are between 0 and 65535.
#srcPostNATPort - integer
#Source Port. The valid port numbers are between 0 and 65535.
#dstPostNATPort - integer
#Destination Port. The valid port numbers are between 0 and 65535.
#identSRC - IPv4 or IPv6 address
#FIELDALIAS-srcip = identSRC AS src_ip
#identHostName
#string
#255
#Host name associated with the event. Typically, this parameter is only associated with identity events
#FIELDALIAS-srcname = identHostName AS src_name
#identNetBios
#string
#255
#NetBIOS name associated with the event. Typically, this parameter is only associated with identity events
#identGrpName
#string
#255
#Group name associated with the event. Typically, this parameter is only associated with identity events.


[kaspersky:threat]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
EXTRACT-signature = Result\\Name\:\s+(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version # todo in lookup files?

### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =


[kaspersky:devctrl]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
EXTRACT-signature = Result\\Name\:\s+(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version # todo in lookup files?


### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =
