#
# TA-kaspersky
# props.conf
#
# Configuration using the LEEF option
#

[kaspersky]
pulldown_type = true
category = Network & Security
description = Kaspersky ES events
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

TRANSFORMS-rename = kaspersky_threat, kaspersky_devctrl, kaspersky_system, kaspersky_appctrl

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
#FIELDALIAS-signature = EVC_EV_VIRUS_NAME AS signature
EXTRACT-signature = (?:(?:Result\\Name\:\s+)|(?:Untreated\:\s+)|(?:Deleted\:\s+))(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
# tag - todo in tags.conf
#FIELDALIAS-user = usrName AS user
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version - todo in lookup files?


### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =


[kaspersky:threat]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
EXTRACT-signature = Result\\Name\:\s+(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version # todo in lookup files?

### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =


[kaspersky:devctrl]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
EXTRACT-signature = Result\\Name\:\s+(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version # todo in lookup files?


### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =


[kaspersky:system]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
EXTRACT-signature = Result\\Name\:\s+(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version # todo in lookup files?


### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =

[kaspersky:appctrl]
pulldown_type = false
MAX_TIMESTAMP_LOOKAHEAD=512
SHOULD_LINEMERGE=false
disabled=false

###### CIM FIELDS ######
### Malware Attacks
EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# category # todo in lookup files
FIELDALIAS-date = devTime AS date
EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
FIELDALIAS-destname = identNetBios AS dest_name
FIELDALIAS-destip = identSrc AS dest_ip
# dest_nt_domain
# file_hash
FIELDALIAS-filename = EVC_EV_FILE_Name AS file_name
FIELDALIAS-filepath = EVC_EV_FILE_Name AS file_path
EXTRACT-signature = Result\\Name\:\s+(?<signature>[^\\|\s]*)
EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
EVAL-src = coalesce(src_name,src_ip,src_host)
# src_bunit
# src_category
# src_priority
EXTRACT-user = User:\s+(?<user>[^\(]*)
EVAL-user = coalesce(user,usrName)
FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

### Malware Operations
FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
# signature_version # todo in lookup files?


### Other
LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action
#LOOKUP-kaspersky_malware_categories =
#LOOKUP-kaspersky_severity =
