#
# TA-kaspersky
# props.conf
#

# Base sourcetypes
[kaspersky:leef]
disabled = false
pulldown_type = true
category = Network & Security
description = Kaspersky SC events (LEEF)
rename = kaspersky

TIME_FORMAT = %Y-%m-%d %H:%M:%S
TIME_PREFIX = devTime\=
MAX_TIMESTAMP_LOOKAHEAD = 19
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\n\r]+)
TRUNCATE = 999999

TRANSFORMS-rename = kaspersky_klaud, kaspersky_klsrv, kaspersky_gnrl, kaspersky_klnag, kaspersky_klprci, kaspersky_klbl


[kaspersky:cef]
disabled = true
pulldown_type = true
category = Network & Security
description = Kaspersky SC events (CEF)
rename = kaspersky

TIME_FORMAT = %s
TIME_PREFIX = rt\=
MAX_TIMESTAMP_LOOKAHEAD = 19
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\n\r]+)
TRUNCATE = 999999

TRANSFORMS-rename = kaspersky_klaud, kaspersky_klsrv, kaspersky_gnrl, kaspersky_klnag, kaspersky_klprci, kaspersky_klbl


# Wildcard configurations
[(?::){0}kaspersky*]
disabled = false
pulldown_type = false

KV_MODE = none

LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action

REPORT-basefields = kaspersky_basefields

EVAL-app = "kl:sc"
EVAL-dvc = coalesce(dvc_name,dvc_ip,dvc_host)
EVAL-dest = coalesce(dest_name,dest_ip,dest_host,dest)
EVAL-src = coalesce(src_name,src_ip,src_host,src)


[kaspersky]
pulldown_type = false


# Renamed sourcetypes
[kaspersky:klaud]
REPORT-kaspersky_dest = kaspersky_dest
REPORT-kaspersky_audit_srcip = kaspersky_audit_srcip
REPORT-kaspersky_audit_user = kaspersky_audit_user
REPORT-kaspersky_audit_action = kaspersky_audit_action

# # TO MOVE TO TRANSFORMS
# #success, failure
# EXTRACT-authentication = (?<vendor_action>has\sconnected\sto\s)
# #Authentication	app	string	The application involved in the event (such as ssh, splunk, win:local).	
# EXTRACT-dest = identNetBios=(?<dest_host>[^\t]*)
# #Authentication	dest_nt_domain	string	The name of the Active Directory used by the authentication target
# #Authentication	duration	    time for the completion of the authentication in seconds.	
# #Authentication	response_time	time it took to receive a response in the authentication in seconds.	
# #Authentication	signature	string	A human-readable signature name.	
# #Authentication	signature_id	string	The unique identifier or event code of the event signature.	
# EXTRACT-src = \s+from\s+\"(?<src>[^\"]*)
# #Authentication	src_nt_domain	string	The name of the Active Directory used by the authentication source, if applicable.	
# EXTRACT-action_modified = (?<action>modified)\sby
# EXTRACT-dvc_name = EVC_EV_DISP_HOST_NAME=(?<dvc_name>[^\t]*)
# EXTRACT-object = EVC_EV_DESC=(?:[^\"]*)"(?<object>[^\"]*)" modified by user \"(?:(?<domain>[^\\]*)\\)?(?<src_user>[^\"]*)


[kaspersky:klprci]
REPORT-fields = kaspersky_dest, kaspersky_dest_product, kaspersky_task

EVAL-date = _time


[kaspersky:klbl]
REPORT-fields = kaspersky_dest


[kaspersky:klsrv]
REPORT-fields = kaspersky_dest


[kaspersky:gnrl]
REPORT-fields = kaspersky_dest, kaspersky_result, kaspersky_result_signature, kaspersky_virus_signature, kaspersky_result_file
REPORT-device = kaspersky_device_category, kaspersky_device_type, kaspersky_device_id, kaspersky_device_action, kaspersky_device_operation

REPORT-file = kaspersky_file
REPORT-kaspersky_result_file = kaspersky_result_file
REPORT-kaspersky_user = kaspersky_user

# EXTRACT-result = EVC_EV_DESC\=Result\:\s+(?<result>[^\:]*)\:\s*(?<signature>[^\\]*)(?:\\r\\nUser\:\s+(?<user>(?:\w*\\)?[^\\]*))?\\r\\nObject\:\s+(?<file_path>[^\t]*)\t

# EXTRACT-userpath = (?:(?:Users)|(?:Documents and Settings)).(?<user>\w+)
# Malware_Attacks	file_hash	string	The hash of the file with suspected malware.	
# Malware_Attacks	file_name	string	The name of the file with suspected malware.	
# Malware_Attacks	file_path	string	The full file path of the file with suspected malware.	
# Malware_Attacks	sender	string	The reported sender of an email-based attack.	

# Malware_Attacks	tag	string	This automatically generated field is used to access tags from within datamodels. Do not define extractions for this field when writing add-ons.	
# Malware_Attacks	user	string	The user involved in the malware event.	
# Malware_Attacks	url	string	A URL containing more information about the vulnerability.	

# Malware_Operations	dest_nt_domain	string	The NT domain of the dest system, if applicable.	

# Malware_Operations	product_version	string	The product version of the malware operations product.	
# Malware_Operations	signature_version	string	The version of the malware signature bundle in a signature update operations event.	
# Malware_Operations	tag	string	The tag associated with the malware operations event.	
# Malware_Operations	vendor_product	string	The vendor product name of the malware operations product.	


[kaspersky:klnag]
REPORT-fields = kaspersky_dest, kaspersky_app_name, kaspersky_app_action


# EXTRACT-dest = EVC_EV_DISP_HOST_NAME=(?<dest_host>[^\t]*)
# EXTRACT-info1 = EVC_EV_DESC=Installation of update \'(?<file_name>[^\']*)\' for modules of application \'(?<app>[^\']*)\' has been (?<state>successfully|started)
# EXTRACT-info2 = EVC_EV_DESC=\'(?<application>[^\']*)\' version \'(?<application_version>[^\']*)\' has been (?<action>removed|installed)

# EVAL-status = "installed"




# ###### CIM FIELDS ######
# ### Malware Attacks
# FIELDALIAS-date = devTime AS date
# FIELDALIAS-destname = identNetBios AS dest_name
# FIELDALIAS-destip = identSrc AS dest_ip



# EXTRACT-file = EVC_EV_FILE_Name=(?<file_path>(?:(?:[^\\]+)(?:[\\]+))+)(?<file_name>[^\t]*)

# EXTRACT-user = User[\:\=]\s?(?:[^\\]*\\)?(?<user>[^\s\r\n]*)
# FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS client_vendor_product

# ### Malware Operations
# FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS client_product_version

# #
# # Renamed sourcetypes
# # (DEPRECATED - See new sourcetypes in the V2 section)
# [kaspersky:threat]
# pulldown_type = false
# MAX_TIMESTAMP_LOOKAHEAD=512
# SHOULD_LINEMERGE=false
# disabled=false

# REPORT-basefields = kaspersky_basefields

# ###### CIM FIELDS ######
# ### Malware Attacks
# EXTRACT-vendoraction = Result\\Description\:\s+(?<vendor_action>[^\\]*)
# FIELDALIAS-date = devTime AS date
# EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
# FIELDALIAS-destname = identNetBios AS dest_name
# FIELDALIAS-destip = identSrc AS dest_ip
# EXTRACT-file = EVC_EV_FILE_Name=(?<file_path>(?:(?:[^\\]+)(?:[\\]+))+)(?<file_name>[^\t]*)
# EXTRACT-signature = (?:(?:Result\\Name\:\s+)|(?:Untreated\:\s+)|(?:Deleted\:\s+))(?<signature>[^\\|\s]*)
# EVAL-signature = coalesce(signature,EVC_EV_VIRUS_NAME)
# EVAL-src = coalesce(src_name,src_ip,src_host)
# EXTRACT-src = Object\:\s+(?<protocol>[^\s]*)\s+from\s+(?<src_ip>[^\s]*)\s+to\s+local\s+port\s+(?<dest_port>[\d]*)
# EXTRACT-user = User[\:\=][\s\t]?(?:[^\\]*\\)?(?<user>.*)(?:\\r\\n)C
# FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

# ### Malware Operations
# FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version

# ### Other
# LOOKUP-kaspersky_action_to_action = kaspersky_sc_actions vendor_action OUTPUT action

# # (DEPRECATED - See new sourcetype in the V2 section)
# [kaspersky:devctrl]
# pulldown_type = false
# disabled = false

# TIME_PREFIX = devTime=
# TIME_FORMAT = %Y-%m-%d %H:%M:%S
# MAX_TIMESTAMP_LOOKAHEAD = 19
# SHOULD_LINEMERGE = false
# LINE_BREAKER = ([\n\r]+)
# TRUNCATE = 999999

# REPORT-basefields = kaspersky_basefields
# FIELDALIAS-date = devTime AS date

# EXTRACT-file = EVC_EV_FILE_Name=(?<file_path>(?:(?:[^\\]+)(?:[\\]+))+)(?<file_name>[^\t]*)

# FIELDALIAS-srcname = identNetBios AS src_name
# FIELDALIAS-srcip = identSrc AS src_ip
# EVAL-src = coalesce(src_name,src_ip,src_host)

# FIELDALIAS-destname = identNetBios AS dest_name
# FIELDALIAS-destip = identSrc AS dest_ip
# EVAL-dest = coalesce(dest_name,dest_ip,dest_host)

# EXTRACT-user = User:\s+(?<user>[^\(]
# EVAL-user = coalesce(user,usrName)

# FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product
# FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version

# # (DEPRECATED - See new sourcetype in the V2 section)
# [kaspersky:system]
# pulldown_type = false
# MAX_TIMESTAMP_LOOKAHEAD=512
# SHOULD_LINEMERGE=false
# disabled=false
# REPORT-basefields = kaspersky_basefields
# ###### CIM FIELDS ######
# ### Malware Attacks
# FIELDALIAS-date = devTime AS date
# FIELDALIAS-destname = identNetBios AS dest_name
# FIELDALIAS-destip = identSrc AS dest_ip
# EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
# EVAL-src = coalesce(src_name,src_ip,src_host)
# EXTRACT-user = User:\s+(?<user>[^\(]*)
# EVAL-user = coalesce(user,usrName)
# FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

# ### Malware Operations
# FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version

# # (DEPRECATED - See new sourcetype in the V2 section)
# [kaspersky:appctrl]
# pulldown_type = false
# MAX_TIMESTAMP_LOOKAHEAD=512
# SHOULD_LINEMERGE=false
# disabled=false

# REPORT-basefields = kaspersky_basefields

# ###### CIM FIELDS ######
# ### Malware Attacks
# FIELDALIAS-date = devTime AS date
# EVAL-dest = coalesce(dest_name,dest_ip,dest_host)
# FIELDALIAS-destname = identNetBios AS dest_name
# FIELDALIAS-destip = identSrc AS dest_ip
# EVAL-src = coalesce(src_name,src_ip,src_host)
# FIELDALIAS-vendorproduct = EVC_EV_KL_PRODUCT_NAME AS vendor_product

# ### Malware Operations
# FIELDALIAS-productversion = EVC_EV_KL_PRODUCT_VER AS product_version
